Sirius-RX/SDVX-SP_Con/Software/Code/CH557.INC
/*  I2C Registers  */
sfr I2CX_INT        = 0xB3;         // I2C slave/master and PWM and LED interrupt request
#define bI2CS_INT_ACT     0x20      // ReadOnly: I2C slave interrupt request: 0=free, 1=action
#define bI2CM_INT_ACT     0x10      // ReadOnly: I2C master interrupt request: 0=free, 1=action
#define bLED_INT_ACT      0x02      // ReadOnly: RGB LED interrupt request: 0=free, 1=action
#define bPWMX_INT_ACT     0x01      // ReadOnly: PWMX interrupt request: 0=free, 1=action
sfr I2CS_INT_ST     = 0xBB;         // I2C slave interrupt status mapped from I2CS_STAT

/*  I2C master Registers  */
#define XSFR_I2CM_BASE    0x21C0    // I2C master register base address

EXTERN  UINT8XV I2CM_CTRL      _AT_ 0x21C0;   // I2C master control
#define pI2CM_CTRL        PBYTE[0xC0]
#define bI2CM_IE          0x80      // interrupt enable for I2C master
#define bI2CM_DEV_ACK     0x10      // ReadOnly: I2C device recent acknowledge status
#define bI2CM_EN          0x08      // I2C master enable
#define bI2CM_CMD1        0x02      // I2C master operation command high bit
#define bI2CM_CMD0        0x01      // I2C master operation command low bit
#define MASK_I2CM_CMD     0x03      // bit mask of I2C master operation command
#define I2CM_CMD_STOP     0x09      // generate STOP condition
#define I2CM_CMD_RX_ACK   0x0A      // receive byte then generate ACK
#define I2CM_CMD_RX_STOP  0x0B      // receive byte then generate not-ACK and STOP condition
// bI2CM_CMD1 & bI2CM_CMD0: I2C master operation command
//   00: free
//   01: generate STOP condition, auto clear after completion
//   10: receive byte then generate ACK, auto clear after completion
//   11: receive byte then generate not-ACK and STOP condition, auto clear after completion

EXTERN  UINT8XV I2CM_CK_SE     _AT_ 0x21C1;   // I2C master clock divisor setting
EXTERN  UINT8XV I2CM_START     _AT_ 0x21C2;   // I2C master start command, write byte to generate START condition then transmit first byte and receive device acknowledge
EXTERN  UINT8XV I2CM_DATA      _AT_ 0x21C3;   // I2C master data buffer, write byte to transmit byte then receive device acknowledge, return received data if read
#define pI2CM_CK_SE       PBYTE[0xC1]
#define pI2CM_START       PBYTE[0xC2]
#define pI2CM_DATA        PBYTE[0xC3]

EXTERN  UINT8XV I2CM_STAT      _AT_ 0x21C4;   // I2C master status
#define pI2CM_STAT        PBYTE[0xC4]
#define bI2CM_IF          0x80      // interrupt flag for I2C master, write 1 to clear or write I2CM_CTRL/I2CM_START/I2CM_DATA to clear
#define MASK_I2CM_STAT    0x70      // ReadOnly: bit mask of I2C master status machine
// MASK_I2CM_STAT: I2C master status machine
//   000: free
//   001~011: START/STOP condition step 1/2/3
//   100~111: byte transfer and acknowledge step 1/2/3/4
#define MASK_I2CM_CNT     0x0F      // ReadOnly: bit count of I2C master

#define XSFR_I2CS_BASE    0x2230    // I2CS register base address

EXTERN  UINT8XV I2CS_CTRL      _AT_ 0x2232;   // I2CS control
#define pI2CS_CTRL        PBYTE[0x32]
#define bI2CS_IE_TRAN     0x80      // byte transmitted interrupt enable for I2C slave
#define bI2CS_IE_RECV     0x40      // byte received interrupt enable for I2C slave
#define bI2CS_IE_ADDR     0x20      // data address received interrupt enable for I2C slave
#define bI2CS_IE_DEV_A    0x10      // device address received interrupt enable for I2C slave, enable general address
#define bI2CS_IE_STASTO   0x08      // START/STOP condition received interrupt enable for I2C slave
#define bI2CS_SDA_IN      0x04      // ReadOnly: current SDA status after synchronization
#define bI2CS_DMA_EN      0x02      // DMA enable for I2C slave
#define bI2CS_EN          0x01      // I2C slave enable

EXTERN  UINT8XV I2CS_DEV_A     _AT_ 0x2233;   // I2CS device address
#define pI2CS_DEV_A       PBYTE[0x33]
#define MASK_I2CS_DEV_A   0xFE      // I2C slave device address: 00=general address, other=device address to match
#define bI2CS_DA_4BIT     0x01      // I2C slave device address mode: 0=7 bits address, 1=4 bits address (ignore low 3 bits)

EXTERN  UINT8XV I2CS_ADDR      _AT_ 0x2235;   // ReadOnly: I2CS data address
EXTERN  UINT8XV I2CS_DATA      _AT_ 0x2236;   // I2CS data buffer
#define pI2CS_ADDR        PBYTE[0x35]
#define pI2CS_DATA        PBYTE[0x36]

EXTERN  UINT8XV I2CS_STAT      _AT_ 0x223A;   // I2CS status
#define pI2CS_STAT        PBYTE[0x3A]
#define bI2CS_IF_STASTO   0x80      // START/STOP condition received interrupt flag for I2C slave, write 1 to clear
#define bI2CS_IF_BYTE     0x40      // byte transferred interrupt flag for I2C slave, write 1 to clear
#define bI2CS_IF_ADDR     0x20      // data address received interrupt flag for I2C slave, write 1 to clear
#define bI2CS_IF_DEV_A    0x10      // device address received interrupt flag for I2C slave, write 1 to clear
#define MASK_I2CS_STAT    0x0F      // ReadOnly: bit mask of I2C slave status machine
// MASK_I2CS_STAT: I2C slave status machine
//   0000: free or receiving device address
//   0001: acknowledging device address received
//   0010: receiving data address
//   0011: acknowledging data address received
//   0100: receiving data byte
//   0101: acknowledging data byte received
//   0110: transmitting data byte
//   0111: checking acknowledge
//   1100: STOP condition, used to judge START/STOP if bI2CS_IF_STASTO=1
//   xxxx: error or unknown

EXTERN  UINT8XV I2CS_DMA_H     _AT_ 0x2138;   // I2CS buffer start address high byte, big-endian
EXTERN  UINT8XV I2CS_DMA_L     _AT_ 0x2139;   // I2CS buffer start address low byte, big-endian
#define MASK_I2CS_AH      0xE0      // ReadOnly: high 3 bits of data address @I2CS_DMA_H if bI2CS_DA_4BIT=1

/*  USB Host/Device Registers  */
sfr UDEV_CTRL       = 0xD1;         // USB device physical port control
#define bUD_PD_EN         0x08      // USB DP/DM pulldown resistance enable: 0=disable pulldown, 1=enable
#define bUD_LOW_SPEED     0x04      // enable USB physical port low speed: 0=full speed, 1=low speed
#define bUD_GP_BIT        0x02      // general purpose bit
#define bUD_PORT_EN       0x01      // enable USB physical port I/O: 0=disable, 1=enable
//sfr UHOST_CTRL      = 0xD1;         // USB host physical port control
#define UHOST_CTRL        UDEV_CTRL
#define UHUB01_CTRL       UDEV_CTRL // USB host root hub0 & hub1 physical port control
#define bUH1_PD_EN        0x80      // USB hub1 HP1/HM1 pulldown resistance enable: 0=disable pulldown, 1=enable
#define bUH1_LOW_SPEED    0x40      // enable USB hub1 port low speed: 0=full speed, 1=low speed
#define bUH1_BUS_RESET    0x20      // control USB hub1 bus reset: 0=normal, 1=force bus reset
#define bUH1_PORT_EN      0x10      // enable USB hub1 port: 0=disable, 1=enable port, automatic disabled if USB device detached
#define bUH0_PD_EN        0x08      // USB hub0 HP0/DP/HM0/DM pulldown resistance enable: 0=disable pulldown, 1=enable
#define bUH0_LOW_SPEED    0x04      // enable USB hub0 port low speed: 0=full speed, 1=low speed
#define bUH0_BUS_RESET    0x02      // control USB hub0 bus reset: 0=normal, 1=force bus reset
#define bUH0_PORT_EN      0x01      // enable USB hub0 port: 0=disable, 1=enable port, automatic disabled if USB device detached
#define bUH_PD_EN         0x08      // USB hub0 HP0/DP/HM0/DM pulldown resistance enable: 0=disable pulldown, 1=enable
#define bUH_LOW_SPEED     0x04      // enable USB hub0 port low speed: 0=full speed, 1=low speed
#define bUH_BUS_RESET     0x02      // control USB hub0 bus reset: 0=normal, 1=force bus reset
#define bUH_PORT_EN       0x01      // enable USB hub0 port: 0=disable, 1=enable port, automatic disabled if USB device detached
sfr UHUB23_CTRL     = 0xE1;         // USB host root hub2 & hub3 physical port control
#define bUH3_PD_EN        0x80      // USB hub3 HP3/HM3 pulldown resistance enable: 0=disable pulldown, 1=enable
#define bUH3_LOW_SPEED    0x40      // enable USB hub3 port low speed: 0=full speed, 1=low speed
#define bUH3_BUS_RESET    0x20      // control USB hub3 bus reset: 0=normal, 1=force bus reset
#define bUH3_PORT_EN      0x10      // enable USB hub3 port: 0=disable, 1=enable port, automatic disabled if USB device detached
#define bUH2_PD_EN        0x08      // USB hub2 HP2/HM2 pulldown resistance enable: 0=disable pulldown, 1=enable
#define bUH2_LOW_SPEED    0x04      // enable USB hub2 port low speed: 0=full speed, 1=low speed
#define bUH2_BUS_RESET    0x02      // control USB hub2 bus reset: 0=normal, 1=force bus reset
#define bUH2_PORT_EN      0x01      // enable USB hub2 port: 0=disable, 1=enable port, automatic disabled if USB device detached
sfr UEP1_CTRL       = 0xD2;         // endpoint 1 control
#define bUEP_R_TOG        0x80      // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define bUEP_T_TOG        0x40      // prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1
#define bUEP_AUTO_TOG     0x10      // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define bUEP_R_RES1       0x08      // handshake response type high bit for USB endpoint X receiving (OUT)
#define bUEP_R_RES0       0x04      // handshake response type low bit for USB endpoint X receiving (OUT)
#define MASK_UEP_R_RES    0x0C      // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define UEP_R_RES_ACK     0x00
#define UEP_R_RES_TOUT    0x04
#define UEP_R_RES_NAK     0x08
#define UEP_R_RES_STALL   0x0C
// bUEP_R_RES1 & bUEP_R_RES0: handshake response type for USB endpoint X receiving (OUT)
//   00: ACK (ready)
//   01: no response, time out to host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
#define bUEP_T_RES1       0x02      // handshake response type high bit for USB endpoint X transmittal (IN)
#define bUEP_T_RES0       0x01      // handshake response type low bit for USB endpoint X transmittal (IN)
#define MASK_UEP_T_RES    0x03      // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define UEP_T_RES_ACK     0x00
#define UEP_T_RES_TOUT    0x01
#define UEP_T_RES_NAK     0x02
#define UEP_T_RES_STALL   0x03
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
//   00: DATA0 or DATA1 then expecting ACK (ready)
//   01: DATA0 or DATA1 then expecting no response, time out from host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
sfr UEP1_T_LEN      = 0xD3;         // endpoint 1 transmittal length
sfr UEP2_CTRL       = 0xD4;         // endpoint 2 control
sfr UEP2_T_LEN      = 0xD5;         // endpoint 2 transmittal length
sfr UEP3_CTRL       = 0xD6;         // endpoint 3 control
sfr UEP3_T_LEN      = 0xD7;         // endpoint 3 transmittal length
sfr USB_INT_FG      = 0xD8;         // USB interrupt flag
 sbit U_IS_NAK      = USB_INT_FG^7; // ReadOnly: indicate current USB transfer is NAK received
 sbit U_TOG_OK      = USB_INT_FG^6; // ReadOnly: indicate current USB transfer toggle is OK
 sbit UIF_FIFO_OV   = USB_INT_FG^4; // FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear
 sbit UIF_HST_SOF   = USB_INT_FG^3; // host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear
 sbit UIF_SUSPEND   = USB_INT_FG^2; // USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear
 sbit UIF_TRANSFER  = USB_INT_FG^1; // USB transfer completion interrupt flag, direct bit address clear or write 1 to clear
 sbit UIF_DETECT    = USB_INT_FG^0; // device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear
 sbit UIF_BUS_RST   = USB_INT_FG^0; // bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear
sfr USB_INT_ST      = 0xD9;         // ReadOnly: USB interrupt status
#define bUIS_SETUP_ACT    0x80      // ReadOnly: indicate SETUP token & 8 bytes setup request received for USB device mode
#define bUIS_TOG_OK       0x40      // ReadOnly: indicate current USB transfer toggle is OK, keep last status during SETUP token
#define bUIS_TOKEN1       0x20      // ReadOnly: current token PID code high bit received for USB device mode, clear UIF_TRANSFER to set free
#define bUIS_TOKEN0       0x10      // ReadOnly: current token PID code low bit received for USB device mode, clear UIF_TRANSFER to set free
#define MASK_UIS_TOKEN    0x30      // ReadOnly: bit mask of current token PID code received for USB device mode
#define UIS_TOKEN_OUT     0x00
#define UIS_TOKEN_SOF     0x10
#define UIS_TOKEN_IN      0x20
#define UIS_TOKEN_FREE    0x30
// bUIS_TOKEN1 & bUIS_TOKEN0: current token PID code received for USB device mode, keep last status during SETUP token, clear UIF_TRANSFER ( UIF_TRANSFER from 1 to 0 ) to set free
//   00: OUT token PID received
//   01: SOF token PID received
//   10: IN token PID received
//   11: free
#define MASK_UIS_ENDP     0x0F      // ReadOnly: bit mask of current transfer endpoint number for USB device mode, keep last status during SETUP token
#define MASK_UIS_H_RES    0x0F      // ReadOnly: bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received
sfr USB_MIS_ST      = 0xDA;         // ReadOnly: USB miscellaneous status
#define bUMS_SOF_PRES     0x80      // ReadOnly: indicate host SOF timer presage status
#define bUMS_SOF_ACT      0x40      // ReadOnly: indicate host SOF timer action status for USB host
#define bUMS_SIE_FREE     0x20      // ReadOnly: indicate USB SIE free status
#define bUMS_R_FIFO_RDY   0x10      // ReadOnly: indicate USB receiving FIFO ready status (not empty)
#define bUMS_BUS_RESET    0x08      // ReadOnly: indicate USB bus reset status
#define bUMS_SUSPEND      0x04      // ReadOnly: indicate USB suspend status
#define bUMS_DM_LEVEL     0x02      // ReadOnly: indicate HM0/DM level saved at device attached to USB host/hub0
#define bUMS_DEV_ATTACH   0x01      // ReadOnly: indicate device attached status on USB host/hub0
sfr USB_RX_LEN      = 0xDB;         // ReadOnly: USB receiving length, keep last data during SETUP token
sfr UEP0_CTRL       = 0xDC;         // endpoint 0 control
sfr UEP0_T_LEN      = 0xDD;         // endpoint 0 transmittal length
sfr UEP4_CTRL       = 0xDE;         // endpoint 4 control
sfr UEP4_T_LEN      = 0xDF;         // endpoint 4 transmittal length
sfr USB_CTRL        = 0xE2;         // USB base control
#define bUC_HOST_MODE     0x80      // enable USB host mode: 0=device mode, 1=host mode
#define bUC_LOW_SPEED     0x40      // enable USB low speed: 0=full speed, 1=low speed
#define bUC_DEV_PU_EN     0x20      // USB device enable and internal pullup resistance (1K5) enable
#define bUC_DEV_EN        0x10      // USB device enable only
#define bUC_SYS_CTRL1     0x20      // USB system control high bit
#define bUC_SYS_CTRL0     0x10      // USB system control low bit
#define MASK_UC_SYS_CTRL  0x30      // bit mask of USB system control
// bUC_HOST_MODE & bUC_SYS_CTRL1 & bUC_SYS_CTRL0: USB system control
//   0 00: disable USB device and disable internal pullup resistance
//   0 01: enable USB device and disable internal pullup resistance, need external pullup resistance
//   0 1x: enable USB device and enable internal pullup resistance
//   1 00: enable USB host and normal status
//   1 01: enable USB host and force DP/DM output SE0 state
//   1 10: enable USB host and force DP/DM output J state
//   1 11: enable USB host and force DP/DM output resume or K state
#define bUC_INT_BUSY      0x08      // enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid
#define bUC_RESET_SIE     0x04      // force reset USB SIE, need software clear
#define bUC_CLR_ALL       0x02      // force clear FIFO and count of USB
sfr USB_DEV_AD      = 0xE3;         // USB device address, lower 7 bits for USB device address
#define bUDA_GP_BIT       0x80      // general purpose bit
#define MASK_USB_ADDR     0x7F      // bit mask for USB device address
sfr16 UEP2_DMA      = 0xE4;         // endpoint 2 buffer start address, little-endian
sfr UEP2_DMA_L      = 0xE4;         // endpoint 2 buffer start address low byte
sfr UEP2_DMA_H      = 0xE5;         // endpoint 2 buffer start address high byte
sfr16 UEP3_DMA      = 0xE6;         // endpoint 3 buffer start address, little-endian
sfr UEP3_DMA_L      = 0xE6;         // endpoint 3 buffer start address low byte
sfr UEP3_DMA_H      = 0xE7;         // endpoint 3 buffer start address high byte
sfr USB_HUB_ST      = 0xEB;         // ReadOnly: USB host hub status
#define bUHS_HM3_LEVEL    0x80      // ReadOnly: indicate HM3 level saved at device attached to USB hub3
#define bUHS_HM2_LEVEL    0x40      // ReadOnly: indicate HM2 level saved at device attached to USB hub2
#define bUHS_HM1_LEVEL    0x20      // ReadOnly: indicate HM1 level saved at device attached to USB hub1
#define bUHS_HM0_LEVEL    0x10      // ReadOnly: indicate HM0/DM level saved at device attached to USB hub0
#define bUHS_H3_ATTACH    0x08      // ReadOnly: indicate device attached status on USB hub3
#define bUHS_H2_ATTACH    0x04      // ReadOnly: indicate device attached status on USB hub2
#define bUHS_H1_ATTACH    0x02      // ReadOnly: indicate device attached status on USB hub1
#define bUHS_H0_ATTACH    0x01      // ReadOnly: indicate device attached status on USB hub0
sfr16 UEP0_DMA      = 0xEC;         // endpoint 0 buffer start address, little-endian
sfr UEP0_DMA_L      = 0xEC;         // endpoint 0 buffer start address low byte
sfr UEP0_DMA_H      = 0xED;         // endpoint 0 buffer start address high byte
sfr16 UEP1_DMA      = 0xEE;         // endpoint 1 buffer start address, little-endian
sfr UEP1_DMA_L      = 0xEE;         // endpoint 1 buffer start address low byte
sfr UEP1_DMA_H      = 0xEF;         // endpoint 1 buffer start address high byte
//sfr UH_SETUP        = 0xD2;         // host aux setup
#define UH_SETUP          UEP1_CTRL
#define bUH_PRE_PID_EN    0x80      // USB host PRE PID enable for low speed device via hub
#define bUH_SOF_EN        0x40      // USB host automatic SOF enable
//sfr UH_RX_CTRL      = 0xD4;         // host receiver endpoint control
#define UH_RX_CTRL        UEP2_CTRL
#define bUH_R_TOG         0x80      // expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1
#define bUH_R_AUTO_TOG    0x10      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define bUH_R_RES         0x04      // prepared handshake response type for host receiving (IN): 0=ACK (ready), 1=no response, time out to device, for isochronous transactions
//sfr UH_EP_PID       = 0xD5;         // host endpoint and token PID, lower 4 bits for endpoint number, upper 4 bits for token PID
#define UH_EP_PID         UEP2_T_LEN
#define MASK_UH_TOKEN     0xF0      // bit mask of token PID for USB host transfer
#define MASK_UH_ENDP      0x0F      // bit mask of endpoint number for USB host transfer
//sfr UH_TX_CTRL      = 0xD6;         // host transmittal endpoint control
#define UH_TX_CTRL        UEP3_CTRL
#define bUH_T_TOG         0x40      // prepared data toggle flag of host transmittal (SETUP/OUT): 0=DATA0, 1=DATA1
#define bUH_T_AUTO_TOG    0x10      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define bUH_T_RES         0x01      // expected handshake response type for host transmittal (SETUP/OUT): 0=ACK (ready), 1=no response, time out from device, for isochronous transactions
//sfr UH_TX_LEN       = 0xD7;         // host transmittal endpoint transmittal length
#define UH_TX_LEN         UEP3_T_LEN
//sfr16 UH_RX_DMA     = 0xE4;         // host rx endpoint buffer start address, little-endian
#define UH_RX_DMA         UEP2_DMA
//sfr UH_RX_DMA_L     = 0xE4;         // host rx endpoint buffer start address low byte
#define UH_RX_DMA_L       UEP2_DMA_L
//sfr UH_RX_DMA_H     = 0xE5;         // host rx endpoint buffer start address high byte
#define UH_RX_DMA_H       UEP2_DMA_H
//sfr16 UH_TX_DMA     = 0xE6;         // host tx endpoint buffer start address, little-endian
#define UH_TX_DMA         UEP3_DMA
//sfr UH_TX_DMA_L     = 0xE6;         // host tx endpoint buffer start address low byte
#define UH_TX_DMA_L       UEP3_DMA_L
//sfr UH_TX_DMA_H     = 0xE7;         // host tx endpoint buffer start address high byte
#define UH_TX_DMA_H       UEP3_DMA_H

#define XSFR_USB_BASE     0x21E0    // USB register base address

EXTERN  UINT8XV UEP4_1_MOD     _AT_ 0x21E0;   // endpoint 4/1 mode
#define pUEP4_1_MOD       PBYTE[0xE0]
#define bUEP1_RX_EN       0x80      // enable USB endpoint 1 receiving (OUT)
#define bUEP1_TX_EN       0x40      // enable USB endpoint 1 transmittal (IN)
#define bUEP1_BUF_MOD     0x10      // buffer mode of USB endpoint 1
// bUEPn_RX_EN & bUEPn_TX_EN & bUEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode, buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  64 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 64 bytes buffer by toggle bit bUEP_R_TOG selection for receiving (OUT endpoint), total=128bytes
//   0 1 0:  64 bytes buffer for transmittal (IN endpoint)
//   0 1 1:  dual 64 bytes buffer by toggle bit bUEP_T_TOG selection for transmittal (IN endpoint), total=128bytes
//   1 1 0:  64 bytes buffer for receiving (OUT endpoint) + 64 bytes buffer for transmittal (IN endpoint), total=128bytes
//   1 1 1:  dual 64 bytes buffer by bUEP_R_TOG selection for receiving (OUT endpoint) + dual 64 bytes buffer by bUEP_T_TOG selection for transmittal (IN endpoint), total=256bytes
#define bUEP4_RX_EN       0x08      // enable USB endpoint 4 receiving (OUT)
#define bUEP4_TX_EN       0x04      // enable USB endpoint 4 transmittal (IN)
// bUEP4_RX_EN & bUEP4_TX_EN: USB endpoint 4 buffer mode, buffer start address is UEP0_DMA
//   0 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//   1 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 receiving (OUT endpoint), total=128bytes
//   0 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=128bytes
//   1 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//           + 64 bytes buffer for endpoint 4 receiving (OUT endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=192bytes

EXTERN  UINT8XV UEP2_3_MOD     _AT_ 0x21E1;   // endpoint 2/3 mode
#define pUEP2_3_MOD       PBYTE[0xE1]
#define bUEP3_RX_EN       0x80      // enable USB endpoint 3 receiving (OUT)
#define bUEP3_TX_EN       0x40      // enable USB endpoint 3 transmittal (IN)
#define bUEP3_BUF_MOD     0x10      // buffer mode of USB endpoint 3
#define bUEP2_RX_EN       0x08      // enable USB endpoint 2 receiving (OUT)
#define bUEP2_TX_EN       0x04      // enable USB endpoint 2 transmittal (IN)
#define bUEP2_BUF_MOD     0x01      // buffer mode of USB endpoint 2

